#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SquadGameInstance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Squad_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SquadGameInstance.BP_SquadGameInstance_C
// 0x0038 (0x0808 - 0x07D0)
class UBP_SquadGameInstance_C final : public USQGameInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USaveDataUIWrapper_C*                   UISaveDataWrapper;                                 // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class USaveData_UI_C* Data)> UI_Data_Changed;                      // 0x07E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class USQSessionInfo*                         SessionInfo;                                       // 0x07F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_ServerPassword_C*                   ServerPasswordWidget;                              // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_ModdedServerWarning_C*              ModdedServerWarning;                               // 0x0800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SquadGameInstance(int32 EntryPoint);
	void PostInit();
	void OnOnlineServicesInitialized();
	void DownloadingModsFinished();
	void OnPasswordSuccess();
	void WarningAcknowledgedHandler();
	void OnSessionFound(const struct FBlueprintSessionResult& SessionResult);
	void ReceiveInit();
	void StartQueue();
	void JoiningCancelled();
	void passwordEnteredForced(const class FString& Password, class UBP_ServerPassword_C* Sender);
	void OnConnectionAccepted();
	void HandleOnQueueForServer(class ASQJoinBeaconClient* NewJoinBeaconClient);
	void On_Origin_Rebase(const struct FVector& OriginLocation);
	void Set_UI_Data(class USaveData_UI_C* UISaveData);
	void Get_UI_Data(class USaveData_UI_C** AsSave_Data_UI);
	void GetMainMenuRef(class UMainMenuScreen_C** REF_MainMenu);
	void Check_Mods(class USQSessionInfo* SessionInfo_0, bool* In_Sync);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SquadGameInstance_C">();
	}
	static class UBP_SquadGameInstance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SquadGameInstance_C>();
	}
};
static_assert(alignof(UBP_SquadGameInstance_C) == 0x000008, "Wrong alignment on UBP_SquadGameInstance_C");
static_assert(sizeof(UBP_SquadGameInstance_C) == 0x000808, "Wrong size on UBP_SquadGameInstance_C");
static_assert(offsetof(UBP_SquadGameInstance_C, UberGraphFrame) == 0x0007D0, "Member 'UBP_SquadGameInstance_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SquadGameInstance_C, UISaveDataWrapper) == 0x0007D8, "Member 'UBP_SquadGameInstance_C::UISaveDataWrapper' has a wrong offset!");
static_assert(offsetof(UBP_SquadGameInstance_C, UI_Data_Changed) == 0x0007E0, "Member 'UBP_SquadGameInstance_C::UI_Data_Changed' has a wrong offset!");
static_assert(offsetof(UBP_SquadGameInstance_C, SessionInfo) == 0x0007F0, "Member 'UBP_SquadGameInstance_C::SessionInfo' has a wrong offset!");
static_assert(offsetof(UBP_SquadGameInstance_C, ServerPasswordWidget) == 0x0007F8, "Member 'UBP_SquadGameInstance_C::ServerPasswordWidget' has a wrong offset!");
static_assert(offsetof(UBP_SquadGameInstance_C, ModdedServerWarning) == 0x000800, "Member 'UBP_SquadGameInstance_C::ModdedServerWarning' has a wrong offset!");

}

