#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayFab

#include "Basic.hpp"

#include "PlayFab_structs.hpp"


namespace SDK::Params
{

// Function PlayFab.PlayFabAdminAPI.AbortTaskInstance
// 0x0050 (0x0050 - 0x0000)
struct PlayFabAdminAPI_AbortTaskInstance final
{
public:
	struct FAdminAbortTaskInstanceRequest         Request;                                           // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminEmptyResponse& Result, class UObject* customData)> OnSuccess;  // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0030(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0040(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_AbortTaskInstance) == 0x000008, "Wrong alignment on PlayFabAdminAPI_AbortTaskInstance");
static_assert(sizeof(PlayFabAdminAPI_AbortTaskInstance) == 0x000050, "Wrong size on PlayFabAdminAPI_AbortTaskInstance");
static_assert(offsetof(PlayFabAdminAPI_AbortTaskInstance, Request) == 0x000000, "Member 'PlayFabAdminAPI_AbortTaskInstance::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AbortTaskInstance, OnSuccess) == 0x000020, "Member 'PlayFabAdminAPI_AbortTaskInstance::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AbortTaskInstance, OnFailure) == 0x000030, "Member 'PlayFabAdminAPI_AbortTaskInstance::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AbortTaskInstance, customData) == 0x000040, "Member 'PlayFabAdminAPI_AbortTaskInstance::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AbortTaskInstance, ReturnValue) == 0x000048, "Member 'PlayFabAdminAPI_AbortTaskInstance::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.AddLocalizedNews
// 0x0080 (0x0080 - 0x0000)
struct PlayFabAdminAPI_AddLocalizedNews final
{
public:
	struct FAdminAddLocalizedNewsRequest          Request;                                           // 0x0000(0x0050)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminAddLocalizedNewsResult& Result, class UObject* customData)> OnSuccess; // 0x0050(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0060(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0070(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_AddLocalizedNews) == 0x000008, "Wrong alignment on PlayFabAdminAPI_AddLocalizedNews");
static_assert(sizeof(PlayFabAdminAPI_AddLocalizedNews) == 0x000080, "Wrong size on PlayFabAdminAPI_AddLocalizedNews");
static_assert(offsetof(PlayFabAdminAPI_AddLocalizedNews, Request) == 0x000000, "Member 'PlayFabAdminAPI_AddLocalizedNews::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AddLocalizedNews, OnSuccess) == 0x000050, "Member 'PlayFabAdminAPI_AddLocalizedNews::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AddLocalizedNews, OnFailure) == 0x000060, "Member 'PlayFabAdminAPI_AddLocalizedNews::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AddLocalizedNews, customData) == 0x000070, "Member 'PlayFabAdminAPI_AddLocalizedNews::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AddLocalizedNews, ReturnValue) == 0x000078, "Member 'PlayFabAdminAPI_AddLocalizedNews::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.AddNews
// 0x0070 (0x0070 - 0x0000)
struct PlayFabAdminAPI_AddNews final
{
public:
	struct FAdminAddNewsRequest                   Request;                                           // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminAddNewsResult& Result, class UObject* customData)> OnSuccess;  // 0x0040(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0050(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0060(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0068(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_AddNews) == 0x000008, "Wrong alignment on PlayFabAdminAPI_AddNews");
static_assert(sizeof(PlayFabAdminAPI_AddNews) == 0x000070, "Wrong size on PlayFabAdminAPI_AddNews");
static_assert(offsetof(PlayFabAdminAPI_AddNews, Request) == 0x000000, "Member 'PlayFabAdminAPI_AddNews::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AddNews, OnSuccess) == 0x000040, "Member 'PlayFabAdminAPI_AddNews::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AddNews, OnFailure) == 0x000050, "Member 'PlayFabAdminAPI_AddNews::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AddNews, customData) == 0x000060, "Member 'PlayFabAdminAPI_AddNews::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AddNews, ReturnValue) == 0x000068, "Member 'PlayFabAdminAPI_AddNews::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.AddPlayerTag
// 0x0060 (0x0060 - 0x0000)
struct PlayFabAdminAPI_AddPlayerTag final
{
public:
	struct FAdminAddPlayerTagRequest              Request;                                           // 0x0000(0x0030)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminAddPlayerTagResult& Result, class UObject* customData)> OnSuccess; // 0x0030(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0040(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0050(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_AddPlayerTag) == 0x000008, "Wrong alignment on PlayFabAdminAPI_AddPlayerTag");
static_assert(sizeof(PlayFabAdminAPI_AddPlayerTag) == 0x000060, "Wrong size on PlayFabAdminAPI_AddPlayerTag");
static_assert(offsetof(PlayFabAdminAPI_AddPlayerTag, Request) == 0x000000, "Member 'PlayFabAdminAPI_AddPlayerTag::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AddPlayerTag, OnSuccess) == 0x000030, "Member 'PlayFabAdminAPI_AddPlayerTag::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AddPlayerTag, OnFailure) == 0x000040, "Member 'PlayFabAdminAPI_AddPlayerTag::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AddPlayerTag, customData) == 0x000050, "Member 'PlayFabAdminAPI_AddPlayerTag::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AddPlayerTag, ReturnValue) == 0x000058, "Member 'PlayFabAdminAPI_AddPlayerTag::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.AddUserVirtualCurrency
// 0x0068 (0x0068 - 0x0000)
struct PlayFabAdminAPI_AddUserVirtualCurrency final
{
public:
	struct FAdminAddUserVirtualCurrencyRequest    Request;                                           // 0x0000(0x0038)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminModifyUserVirtualCurrencyResult& Result, class UObject* customData)> OnSuccess; // 0x0038(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0048(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0058(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_AddUserVirtualCurrency) == 0x000008, "Wrong alignment on PlayFabAdminAPI_AddUserVirtualCurrency");
static_assert(sizeof(PlayFabAdminAPI_AddUserVirtualCurrency) == 0x000068, "Wrong size on PlayFabAdminAPI_AddUserVirtualCurrency");
static_assert(offsetof(PlayFabAdminAPI_AddUserVirtualCurrency, Request) == 0x000000, "Member 'PlayFabAdminAPI_AddUserVirtualCurrency::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AddUserVirtualCurrency, OnSuccess) == 0x000038, "Member 'PlayFabAdminAPI_AddUserVirtualCurrency::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AddUserVirtualCurrency, OnFailure) == 0x000048, "Member 'PlayFabAdminAPI_AddUserVirtualCurrency::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AddUserVirtualCurrency, customData) == 0x000058, "Member 'PlayFabAdminAPI_AddUserVirtualCurrency::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AddUserVirtualCurrency, ReturnValue) == 0x000060, "Member 'PlayFabAdminAPI_AddUserVirtualCurrency::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.AddVirtualCurrencyTypes
// 0x0048 (0x0048 - 0x0000)
struct PlayFabAdminAPI_AddVirtualCurrencyTypes final
{
public:
	struct FAdminAddVirtualCurrencyTypesRequest   Request;                                           // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminBlankResult& Result, class UObject* customData)> OnSuccess;    // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0028(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_AddVirtualCurrencyTypes) == 0x000008, "Wrong alignment on PlayFabAdminAPI_AddVirtualCurrencyTypes");
static_assert(sizeof(PlayFabAdminAPI_AddVirtualCurrencyTypes) == 0x000048, "Wrong size on PlayFabAdminAPI_AddVirtualCurrencyTypes");
static_assert(offsetof(PlayFabAdminAPI_AddVirtualCurrencyTypes, Request) == 0x000000, "Member 'PlayFabAdminAPI_AddVirtualCurrencyTypes::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AddVirtualCurrencyTypes, OnSuccess) == 0x000018, "Member 'PlayFabAdminAPI_AddVirtualCurrencyTypes::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AddVirtualCurrencyTypes, OnFailure) == 0x000028, "Member 'PlayFabAdminAPI_AddVirtualCurrencyTypes::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AddVirtualCurrencyTypes, customData) == 0x000038, "Member 'PlayFabAdminAPI_AddVirtualCurrencyTypes::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_AddVirtualCurrencyTypes, ReturnValue) == 0x000040, "Member 'PlayFabAdminAPI_AddVirtualCurrencyTypes::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.BanUsers
// 0x0050 (0x0050 - 0x0000)
struct PlayFabAdminAPI_BanUsers final
{
public:
	struct FAdminBanUsersRequest                  Request;                                           // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminBanUsersResult& Result, class UObject* customData)> OnSuccess; // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0030(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0040(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_BanUsers) == 0x000008, "Wrong alignment on PlayFabAdminAPI_BanUsers");
static_assert(sizeof(PlayFabAdminAPI_BanUsers) == 0x000050, "Wrong size on PlayFabAdminAPI_BanUsers");
static_assert(offsetof(PlayFabAdminAPI_BanUsers, Request) == 0x000000, "Member 'PlayFabAdminAPI_BanUsers::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_BanUsers, OnSuccess) == 0x000020, "Member 'PlayFabAdminAPI_BanUsers::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_BanUsers, OnFailure) == 0x000030, "Member 'PlayFabAdminAPI_BanUsers::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_BanUsers, customData) == 0x000040, "Member 'PlayFabAdminAPI_BanUsers::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_BanUsers, ReturnValue) == 0x000048, "Member 'PlayFabAdminAPI_BanUsers::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.CheckLimitedEditionItemAvailability
// 0x0058 (0x0058 - 0x0000)
struct PlayFabAdminAPI_CheckLimitedEditionItemAvailability final
{
public:
	struct FAdminCheckLimitedEditionItemAvailabilityRequest Request;                                 // 0x0000(0x0028)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminCheckLimitedEditionItemAvailabilityResult& Result, class UObject* customData)> OnSuccess; // 0x0028(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0038(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0048(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_CheckLimitedEditionItemAvailability) == 0x000008, "Wrong alignment on PlayFabAdminAPI_CheckLimitedEditionItemAvailability");
static_assert(sizeof(PlayFabAdminAPI_CheckLimitedEditionItemAvailability) == 0x000058, "Wrong size on PlayFabAdminAPI_CheckLimitedEditionItemAvailability");
static_assert(offsetof(PlayFabAdminAPI_CheckLimitedEditionItemAvailability, Request) == 0x000000, "Member 'PlayFabAdminAPI_CheckLimitedEditionItemAvailability::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CheckLimitedEditionItemAvailability, OnSuccess) == 0x000028, "Member 'PlayFabAdminAPI_CheckLimitedEditionItemAvailability::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CheckLimitedEditionItemAvailability, OnFailure) == 0x000038, "Member 'PlayFabAdminAPI_CheckLimitedEditionItemAvailability::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CheckLimitedEditionItemAvailability, customData) == 0x000048, "Member 'PlayFabAdminAPI_CheckLimitedEditionItemAvailability::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CheckLimitedEditionItemAvailability, ReturnValue) == 0x000050, "Member 'PlayFabAdminAPI_CheckLimitedEditionItemAvailability::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.CreateActionsOnPlayersInSegmentTask
// 0x0080 (0x0080 - 0x0000)
struct PlayFabAdminAPI_CreateActionsOnPlayersInSegmentTask final
{
public:
	struct FAdminCreateActionsOnPlayerSegmentTaskRequest Request;                                    // 0x0000(0x0050)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminCreateTaskResult& Result, class UObject* customData)> OnSuccess; // 0x0050(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0060(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0070(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_CreateActionsOnPlayersInSegmentTask) == 0x000008, "Wrong alignment on PlayFabAdminAPI_CreateActionsOnPlayersInSegmentTask");
static_assert(sizeof(PlayFabAdminAPI_CreateActionsOnPlayersInSegmentTask) == 0x000080, "Wrong size on PlayFabAdminAPI_CreateActionsOnPlayersInSegmentTask");
static_assert(offsetof(PlayFabAdminAPI_CreateActionsOnPlayersInSegmentTask, Request) == 0x000000, "Member 'PlayFabAdminAPI_CreateActionsOnPlayersInSegmentTask::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreateActionsOnPlayersInSegmentTask, OnSuccess) == 0x000050, "Member 'PlayFabAdminAPI_CreateActionsOnPlayersInSegmentTask::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreateActionsOnPlayersInSegmentTask, OnFailure) == 0x000060, "Member 'PlayFabAdminAPI_CreateActionsOnPlayersInSegmentTask::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreateActionsOnPlayersInSegmentTask, customData) == 0x000070, "Member 'PlayFabAdminAPI_CreateActionsOnPlayersInSegmentTask::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreateActionsOnPlayersInSegmentTask, ReturnValue) == 0x000078, "Member 'PlayFabAdminAPI_CreateActionsOnPlayersInSegmentTask::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.CreateCloudScriptTask
// 0x0080 (0x0080 - 0x0000)
struct PlayFabAdminAPI_CreateCloudScriptTask final
{
public:
	struct FAdminCreateCloudScriptTaskRequest     Request;                                           // 0x0000(0x0050)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminCreateTaskResult& Result, class UObject* customData)> OnSuccess; // 0x0050(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0060(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0070(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_CreateCloudScriptTask) == 0x000008, "Wrong alignment on PlayFabAdminAPI_CreateCloudScriptTask");
static_assert(sizeof(PlayFabAdminAPI_CreateCloudScriptTask) == 0x000080, "Wrong size on PlayFabAdminAPI_CreateCloudScriptTask");
static_assert(offsetof(PlayFabAdminAPI_CreateCloudScriptTask, Request) == 0x000000, "Member 'PlayFabAdminAPI_CreateCloudScriptTask::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreateCloudScriptTask, OnSuccess) == 0x000050, "Member 'PlayFabAdminAPI_CreateCloudScriptTask::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreateCloudScriptTask, OnFailure) == 0x000060, "Member 'PlayFabAdminAPI_CreateCloudScriptTask::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreateCloudScriptTask, customData) == 0x000070, "Member 'PlayFabAdminAPI_CreateCloudScriptTask::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreateCloudScriptTask, ReturnValue) == 0x000078, "Member 'PlayFabAdminAPI_CreateCloudScriptTask::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.CreateInsightsScheduledScalingTask
// 0x0080 (0x0080 - 0x0000)
struct PlayFabAdminAPI_CreateInsightsScheduledScalingTask final
{
public:
	struct FAdminCreateInsightsScheduledScalingTaskRequest Request;                                  // 0x0000(0x0050)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminCreateTaskResult& Result, class UObject* customData)> OnSuccess; // 0x0050(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0060(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0070(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_CreateInsightsScheduledScalingTask) == 0x000008, "Wrong alignment on PlayFabAdminAPI_CreateInsightsScheduledScalingTask");
static_assert(sizeof(PlayFabAdminAPI_CreateInsightsScheduledScalingTask) == 0x000080, "Wrong size on PlayFabAdminAPI_CreateInsightsScheduledScalingTask");
static_assert(offsetof(PlayFabAdminAPI_CreateInsightsScheduledScalingTask, Request) == 0x000000, "Member 'PlayFabAdminAPI_CreateInsightsScheduledScalingTask::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreateInsightsScheduledScalingTask, OnSuccess) == 0x000050, "Member 'PlayFabAdminAPI_CreateInsightsScheduledScalingTask::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreateInsightsScheduledScalingTask, OnFailure) == 0x000060, "Member 'PlayFabAdminAPI_CreateInsightsScheduledScalingTask::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreateInsightsScheduledScalingTask, customData) == 0x000070, "Member 'PlayFabAdminAPI_CreateInsightsScheduledScalingTask::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreateInsightsScheduledScalingTask, ReturnValue) == 0x000078, "Member 'PlayFabAdminAPI_CreateInsightsScheduledScalingTask::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.CreateOpenIdConnection
// 0x0088 (0x0088 - 0x0000)
struct PlayFabAdminAPI_CreateOpenIdConnection final
{
public:
	struct FAdminCreateOpenIdConnectionRequest    Request;                                           // 0x0000(0x0058)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminEmptyResponse& Result, class UObject* customData)> OnSuccess;  // 0x0058(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0068(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0078(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0080(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_CreateOpenIdConnection) == 0x000008, "Wrong alignment on PlayFabAdminAPI_CreateOpenIdConnection");
static_assert(sizeof(PlayFabAdminAPI_CreateOpenIdConnection) == 0x000088, "Wrong size on PlayFabAdminAPI_CreateOpenIdConnection");
static_assert(offsetof(PlayFabAdminAPI_CreateOpenIdConnection, Request) == 0x000000, "Member 'PlayFabAdminAPI_CreateOpenIdConnection::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreateOpenIdConnection, OnSuccess) == 0x000058, "Member 'PlayFabAdminAPI_CreateOpenIdConnection::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreateOpenIdConnection, OnFailure) == 0x000068, "Member 'PlayFabAdminAPI_CreateOpenIdConnection::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreateOpenIdConnection, customData) == 0x000078, "Member 'PlayFabAdminAPI_CreateOpenIdConnection::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreateOpenIdConnection, ReturnValue) == 0x000080, "Member 'PlayFabAdminAPI_CreateOpenIdConnection::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.CreatePlayerSharedSecret
// 0x0048 (0x0048 - 0x0000)
struct PlayFabAdminAPI_CreatePlayerSharedSecret final
{
public:
	struct FAdminCreatePlayerSharedSecretRequest  Request;                                           // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminCreatePlayerSharedSecretResult& Result, class UObject* customData)> OnSuccess; // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0028(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_CreatePlayerSharedSecret) == 0x000008, "Wrong alignment on PlayFabAdminAPI_CreatePlayerSharedSecret");
static_assert(sizeof(PlayFabAdminAPI_CreatePlayerSharedSecret) == 0x000048, "Wrong size on PlayFabAdminAPI_CreatePlayerSharedSecret");
static_assert(offsetof(PlayFabAdminAPI_CreatePlayerSharedSecret, Request) == 0x000000, "Member 'PlayFabAdminAPI_CreatePlayerSharedSecret::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreatePlayerSharedSecret, OnSuccess) == 0x000018, "Member 'PlayFabAdminAPI_CreatePlayerSharedSecret::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreatePlayerSharedSecret, OnFailure) == 0x000028, "Member 'PlayFabAdminAPI_CreatePlayerSharedSecret::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreatePlayerSharedSecret, customData) == 0x000038, "Member 'PlayFabAdminAPI_CreatePlayerSharedSecret::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreatePlayerSharedSecret, ReturnValue) == 0x000040, "Member 'PlayFabAdminAPI_CreatePlayerSharedSecret::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.CreatePlayerStatisticDefinition
// 0x0060 (0x0060 - 0x0000)
struct PlayFabAdminAPI_CreatePlayerStatisticDefinition final
{
public:
	struct FAdminCreatePlayerStatisticDefinitionRequest Request;                                     // 0x0000(0x0030)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminCreatePlayerStatisticDefinitionResult& Result, class UObject* customData)> OnSuccess; // 0x0030(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0040(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0050(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_CreatePlayerStatisticDefinition) == 0x000008, "Wrong alignment on PlayFabAdminAPI_CreatePlayerStatisticDefinition");
static_assert(sizeof(PlayFabAdminAPI_CreatePlayerStatisticDefinition) == 0x000060, "Wrong size on PlayFabAdminAPI_CreatePlayerStatisticDefinition");
static_assert(offsetof(PlayFabAdminAPI_CreatePlayerStatisticDefinition, Request) == 0x000000, "Member 'PlayFabAdminAPI_CreatePlayerStatisticDefinition::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreatePlayerStatisticDefinition, OnSuccess) == 0x000030, "Member 'PlayFabAdminAPI_CreatePlayerStatisticDefinition::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreatePlayerStatisticDefinition, OnFailure) == 0x000040, "Member 'PlayFabAdminAPI_CreatePlayerStatisticDefinition::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreatePlayerStatisticDefinition, customData) == 0x000050, "Member 'PlayFabAdminAPI_CreatePlayerStatisticDefinition::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreatePlayerStatisticDefinition, ReturnValue) == 0x000058, "Member 'PlayFabAdminAPI_CreatePlayerStatisticDefinition::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.CreateSegment
// 0x0040 (0x0040 - 0x0000)
struct PlayFabAdminAPI_CreateSegment final
{
public:
	struct FAdminCreateSegmentRequest             Request;                                           // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminCreateSegmentResponse& Result, class UObject* customData)> OnSuccess; // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_CreateSegment) == 0x000008, "Wrong alignment on PlayFabAdminAPI_CreateSegment");
static_assert(sizeof(PlayFabAdminAPI_CreateSegment) == 0x000040, "Wrong size on PlayFabAdminAPI_CreateSegment");
static_assert(offsetof(PlayFabAdminAPI_CreateSegment, Request) == 0x000000, "Member 'PlayFabAdminAPI_CreateSegment::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreateSegment, OnSuccess) == 0x000010, "Member 'PlayFabAdminAPI_CreateSegment::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreateSegment, OnFailure) == 0x000020, "Member 'PlayFabAdminAPI_CreateSegment::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreateSegment, customData) == 0x000030, "Member 'PlayFabAdminAPI_CreateSegment::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_CreateSegment, ReturnValue) == 0x000038, "Member 'PlayFabAdminAPI_CreateSegment::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.DeleteContent
// 0x0048 (0x0048 - 0x0000)
struct PlayFabAdminAPI_DeleteContent final
{
public:
	struct FAdminDeleteContentRequest             Request;                                           // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminBlankResult& Result, class UObject* customData)> OnSuccess;    // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0028(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_DeleteContent) == 0x000008, "Wrong alignment on PlayFabAdminAPI_DeleteContent");
static_assert(sizeof(PlayFabAdminAPI_DeleteContent) == 0x000048, "Wrong size on PlayFabAdminAPI_DeleteContent");
static_assert(offsetof(PlayFabAdminAPI_DeleteContent, Request) == 0x000000, "Member 'PlayFabAdminAPI_DeleteContent::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteContent, OnSuccess) == 0x000018, "Member 'PlayFabAdminAPI_DeleteContent::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteContent, OnFailure) == 0x000028, "Member 'PlayFabAdminAPI_DeleteContent::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteContent, customData) == 0x000038, "Member 'PlayFabAdminAPI_DeleteContent::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteContent, ReturnValue) == 0x000040, "Member 'PlayFabAdminAPI_DeleteContent::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.DeleteMasterPlayerAccount
// 0x0058 (0x0058 - 0x0000)
struct PlayFabAdminAPI_DeleteMasterPlayerAccount final
{
public:
	struct FAdminDeleteMasterPlayerAccountRequest Request;                                           // 0x0000(0x0028)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminDeleteMasterPlayerAccountResult& Result, class UObject* customData)> OnSuccess; // 0x0028(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0038(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0048(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_DeleteMasterPlayerAccount) == 0x000008, "Wrong alignment on PlayFabAdminAPI_DeleteMasterPlayerAccount");
static_assert(sizeof(PlayFabAdminAPI_DeleteMasterPlayerAccount) == 0x000058, "Wrong size on PlayFabAdminAPI_DeleteMasterPlayerAccount");
static_assert(offsetof(PlayFabAdminAPI_DeleteMasterPlayerAccount, Request) == 0x000000, "Member 'PlayFabAdminAPI_DeleteMasterPlayerAccount::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteMasterPlayerAccount, OnSuccess) == 0x000028, "Member 'PlayFabAdminAPI_DeleteMasterPlayerAccount::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteMasterPlayerAccount, OnFailure) == 0x000038, "Member 'PlayFabAdminAPI_DeleteMasterPlayerAccount::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteMasterPlayerAccount, customData) == 0x000048, "Member 'PlayFabAdminAPI_DeleteMasterPlayerAccount::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteMasterPlayerAccount, ReturnValue) == 0x000050, "Member 'PlayFabAdminAPI_DeleteMasterPlayerAccount::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.DeleteMembershipSubscription
// 0x0070 (0x0070 - 0x0000)
struct PlayFabAdminAPI_DeleteMembershipSubscription final
{
public:
	struct FAdminDeleteMembershipSubscriptionRequest Request;                                        // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminDeleteMembershipSubscriptionResult& Result, class UObject* customData)> OnSuccess; // 0x0040(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0050(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0060(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0068(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_DeleteMembershipSubscription) == 0x000008, "Wrong alignment on PlayFabAdminAPI_DeleteMembershipSubscription");
static_assert(sizeof(PlayFabAdminAPI_DeleteMembershipSubscription) == 0x000070, "Wrong size on PlayFabAdminAPI_DeleteMembershipSubscription");
static_assert(offsetof(PlayFabAdminAPI_DeleteMembershipSubscription, Request) == 0x000000, "Member 'PlayFabAdminAPI_DeleteMembershipSubscription::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteMembershipSubscription, OnSuccess) == 0x000040, "Member 'PlayFabAdminAPI_DeleteMembershipSubscription::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteMembershipSubscription, OnFailure) == 0x000050, "Member 'PlayFabAdminAPI_DeleteMembershipSubscription::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteMembershipSubscription, customData) == 0x000060, "Member 'PlayFabAdminAPI_DeleteMembershipSubscription::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteMembershipSubscription, ReturnValue) == 0x000068, "Member 'PlayFabAdminAPI_DeleteMembershipSubscription::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.DeleteOpenIdConnection
// 0x0048 (0x0048 - 0x0000)
struct PlayFabAdminAPI_DeleteOpenIdConnection final
{
public:
	struct FAdminDeleteOpenIdConnectionRequest    Request;                                           // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminEmptyResponse& Result, class UObject* customData)> OnSuccess;  // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0028(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_DeleteOpenIdConnection) == 0x000008, "Wrong alignment on PlayFabAdminAPI_DeleteOpenIdConnection");
static_assert(sizeof(PlayFabAdminAPI_DeleteOpenIdConnection) == 0x000048, "Wrong size on PlayFabAdminAPI_DeleteOpenIdConnection");
static_assert(offsetof(PlayFabAdminAPI_DeleteOpenIdConnection, Request) == 0x000000, "Member 'PlayFabAdminAPI_DeleteOpenIdConnection::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteOpenIdConnection, OnSuccess) == 0x000018, "Member 'PlayFabAdminAPI_DeleteOpenIdConnection::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteOpenIdConnection, OnFailure) == 0x000028, "Member 'PlayFabAdminAPI_DeleteOpenIdConnection::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteOpenIdConnection, customData) == 0x000038, "Member 'PlayFabAdminAPI_DeleteOpenIdConnection::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteOpenIdConnection, ReturnValue) == 0x000040, "Member 'PlayFabAdminAPI_DeleteOpenIdConnection::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.DeletePlayer
// 0x0048 (0x0048 - 0x0000)
struct PlayFabAdminAPI_DeletePlayer final
{
public:
	struct FAdminDeletePlayerRequest              Request;                                           // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminDeletePlayerResult& Result, class UObject* customData)> OnSuccess; // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0028(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_DeletePlayer) == 0x000008, "Wrong alignment on PlayFabAdminAPI_DeletePlayer");
static_assert(sizeof(PlayFabAdminAPI_DeletePlayer) == 0x000048, "Wrong size on PlayFabAdminAPI_DeletePlayer");
static_assert(offsetof(PlayFabAdminAPI_DeletePlayer, Request) == 0x000000, "Member 'PlayFabAdminAPI_DeletePlayer::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeletePlayer, OnSuccess) == 0x000018, "Member 'PlayFabAdminAPI_DeletePlayer::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeletePlayer, OnFailure) == 0x000028, "Member 'PlayFabAdminAPI_DeletePlayer::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeletePlayer, customData) == 0x000038, "Member 'PlayFabAdminAPI_DeletePlayer::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeletePlayer, ReturnValue) == 0x000040, "Member 'PlayFabAdminAPI_DeletePlayer::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.DeletePlayerSharedSecret
// 0x0048 (0x0048 - 0x0000)
struct PlayFabAdminAPI_DeletePlayerSharedSecret final
{
public:
	struct FAdminDeletePlayerSharedSecretRequest  Request;                                           // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminDeletePlayerSharedSecretResult& Result, class UObject* customData)> OnSuccess; // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0028(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_DeletePlayerSharedSecret) == 0x000008, "Wrong alignment on PlayFabAdminAPI_DeletePlayerSharedSecret");
static_assert(sizeof(PlayFabAdminAPI_DeletePlayerSharedSecret) == 0x000048, "Wrong size on PlayFabAdminAPI_DeletePlayerSharedSecret");
static_assert(offsetof(PlayFabAdminAPI_DeletePlayerSharedSecret, Request) == 0x000000, "Member 'PlayFabAdminAPI_DeletePlayerSharedSecret::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeletePlayerSharedSecret, OnSuccess) == 0x000018, "Member 'PlayFabAdminAPI_DeletePlayerSharedSecret::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeletePlayerSharedSecret, OnFailure) == 0x000028, "Member 'PlayFabAdminAPI_DeletePlayerSharedSecret::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeletePlayerSharedSecret, customData) == 0x000038, "Member 'PlayFabAdminAPI_DeletePlayerSharedSecret::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeletePlayerSharedSecret, ReturnValue) == 0x000040, "Member 'PlayFabAdminAPI_DeletePlayerSharedSecret::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.DeleteSegment
// 0x0048 (0x0048 - 0x0000)
struct PlayFabAdminAPI_DeleteSegment final
{
public:
	struct FAdminDeleteSegmentRequest             Request;                                           // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminDeleteSegmentsResponse& Result, class UObject* customData)> OnSuccess; // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0028(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_DeleteSegment) == 0x000008, "Wrong alignment on PlayFabAdminAPI_DeleteSegment");
static_assert(sizeof(PlayFabAdminAPI_DeleteSegment) == 0x000048, "Wrong size on PlayFabAdminAPI_DeleteSegment");
static_assert(offsetof(PlayFabAdminAPI_DeleteSegment, Request) == 0x000000, "Member 'PlayFabAdminAPI_DeleteSegment::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteSegment, OnSuccess) == 0x000018, "Member 'PlayFabAdminAPI_DeleteSegment::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteSegment, OnFailure) == 0x000028, "Member 'PlayFabAdminAPI_DeleteSegment::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteSegment, customData) == 0x000038, "Member 'PlayFabAdminAPI_DeleteSegment::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteSegment, ReturnValue) == 0x000040, "Member 'PlayFabAdminAPI_DeleteSegment::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.DeleteStore
// 0x0060 (0x0060 - 0x0000)
struct PlayFabAdminAPI_DeleteStore final
{
public:
	struct FAdminDeleteStoreRequest               Request;                                           // 0x0000(0x0030)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminDeleteStoreResult& Result, class UObject* customData)> OnSuccess; // 0x0030(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0040(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0050(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_DeleteStore) == 0x000008, "Wrong alignment on PlayFabAdminAPI_DeleteStore");
static_assert(sizeof(PlayFabAdminAPI_DeleteStore) == 0x000060, "Wrong size on PlayFabAdminAPI_DeleteStore");
static_assert(offsetof(PlayFabAdminAPI_DeleteStore, Request) == 0x000000, "Member 'PlayFabAdminAPI_DeleteStore::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteStore, OnSuccess) == 0x000030, "Member 'PlayFabAdminAPI_DeleteStore::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteStore, OnFailure) == 0x000040, "Member 'PlayFabAdminAPI_DeleteStore::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteStore, customData) == 0x000050, "Member 'PlayFabAdminAPI_DeleteStore::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteStore, ReturnValue) == 0x000058, "Member 'PlayFabAdminAPI_DeleteStore::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.DeleteTask
// 0x0040 (0x0040 - 0x0000)
struct PlayFabAdminAPI_DeleteTask final
{
public:
	struct FAdminDeleteTaskRequest                Request;                                           // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminEmptyResponse& Result, class UObject* customData)> OnSuccess;  // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_DeleteTask) == 0x000008, "Wrong alignment on PlayFabAdminAPI_DeleteTask");
static_assert(sizeof(PlayFabAdminAPI_DeleteTask) == 0x000040, "Wrong size on PlayFabAdminAPI_DeleteTask");
static_assert(offsetof(PlayFabAdminAPI_DeleteTask, Request) == 0x000000, "Member 'PlayFabAdminAPI_DeleteTask::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteTask, OnSuccess) == 0x000010, "Member 'PlayFabAdminAPI_DeleteTask::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteTask, OnFailure) == 0x000020, "Member 'PlayFabAdminAPI_DeleteTask::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteTask, customData) == 0x000030, "Member 'PlayFabAdminAPI_DeleteTask::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteTask, ReturnValue) == 0x000038, "Member 'PlayFabAdminAPI_DeleteTask::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.DeleteTitle
// 0x0038 (0x0038 - 0x0000)
struct PlayFabAdminAPI_DeleteTitle final
{
public:
	struct FAdminDeleteTitleRequest               Request;                                           // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminDeleteTitleResult& Result, class UObject* customData)> OnSuccess; // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_DeleteTitle) == 0x000008, "Wrong alignment on PlayFabAdminAPI_DeleteTitle");
static_assert(sizeof(PlayFabAdminAPI_DeleteTitle) == 0x000038, "Wrong size on PlayFabAdminAPI_DeleteTitle");
static_assert(offsetof(PlayFabAdminAPI_DeleteTitle, Request) == 0x000000, "Member 'PlayFabAdminAPI_DeleteTitle::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteTitle, OnSuccess) == 0x000008, "Member 'PlayFabAdminAPI_DeleteTitle::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteTitle, OnFailure) == 0x000018, "Member 'PlayFabAdminAPI_DeleteTitle::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteTitle, customData) == 0x000028, "Member 'PlayFabAdminAPI_DeleteTitle::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteTitle, ReturnValue) == 0x000030, "Member 'PlayFabAdminAPI_DeleteTitle::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.DeleteTitleDataOverride
// 0x0048 (0x0048 - 0x0000)
struct PlayFabAdminAPI_DeleteTitleDataOverride final
{
public:
	struct FAdminDeleteTitleDataOverrideRequest   Request;                                           // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminDeleteTitleDataOverrideResult& Result, class UObject* customData)> OnSuccess; // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0028(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_DeleteTitleDataOverride) == 0x000008, "Wrong alignment on PlayFabAdminAPI_DeleteTitleDataOverride");
static_assert(sizeof(PlayFabAdminAPI_DeleteTitleDataOverride) == 0x000048, "Wrong size on PlayFabAdminAPI_DeleteTitleDataOverride");
static_assert(offsetof(PlayFabAdminAPI_DeleteTitleDataOverride, Request) == 0x000000, "Member 'PlayFabAdminAPI_DeleteTitleDataOverride::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteTitleDataOverride, OnSuccess) == 0x000018, "Member 'PlayFabAdminAPI_DeleteTitleDataOverride::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteTitleDataOverride, OnFailure) == 0x000028, "Member 'PlayFabAdminAPI_DeleteTitleDataOverride::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteTitleDataOverride, customData) == 0x000038, "Member 'PlayFabAdminAPI_DeleteTitleDataOverride::customData' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_DeleteTitleDataOverride, ReturnValue) == 0x000040, "Member 'PlayFabAdminAPI_DeleteTitleDataOverride::ReturnValue' has a wrong offset!");

// Function PlayFab.PlayFabAdminAPI.ExportMasterPlayerData
// 0x0048 (0x0048 - 0x0000)
struct PlayFabAdminAPI_ExportMasterPlayerData final
{
public:
	struct FAdminExportMasterPlayerDataRequest    Request;                                           // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAdminExportMasterPlayerDataResult& Result, class UObject* customData)> OnSuccess; // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* customData)> OnFailure;         // 0x0028(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                customData;                                        // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                       ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayFabAdminAPI_ExportMasterPlayerData) == 0x000008, "Wrong alignment on PlayFabAdminAPI_ExportMasterPlayerData");
static_assert(sizeof(PlayFabAdminAPI_ExportMasterPlayerData) == 0x000048, "Wrong size on PlayFabAdminAPI_ExportMasterPlayerData");
static_assert(offsetof(PlayFabAdminAPI_ExportMasterPlayerData, Request) == 0x000000, "Member 'PlayFabAdminAPI_ExportMasterPlayerData::Request' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_ExportMasterPlayerData, OnSuccess) == 0x000018, "Member 'PlayFabAdminAPI_ExportMasterPlayerData::OnSuccess' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_ExportMasterPlayerData, OnFailure) == 0x000028, "Member 'PlayFabAdminAPI_ExportMasterPlayerData::OnFailure' has a wrong offset!");
static_assert(offsetof(PlayFabAdminAPI_ExportMasterPlayerData, customData) == 0x000038, "Member 'PlayFabAdminAPI_ExportMasterPlayerData::customData' has a wrong offset!");
