#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SQOnlineServices

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "SQOnlineServices_structs.hpp"
#include "Engine_classes.hpp"
#include "OnlineSubsystemUtils_structs.hpp"


namespace SDK
{

// Class SQOnlineServices.SQOnlineServicesOnlineUser
// 0x0030 (0x0058 - 0x0028)
class USQOnlineServicesOnlineUser : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               CachedAvatar;                                      // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bWasSuccessful, class UTexture* ResultTexture)> OnGetAvatarComplete; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FString GetPlatform();
	void GetUserAvatar(class UTexture* DefaultTexture);
	bool IsReady();

	class FString GetRealName() const;
	TArray<class FString> GetRelatedIds() const;
	class FString GetSteamID() const;
	struct FUniqueNetIdRepl GetUniqueID() const;
	class FString GetUniqueIDString() const;
	class FString GetUserName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQOnlineServicesOnlineUser">();
	}
	static class USQOnlineServicesOnlineUser* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQOnlineServicesOnlineUser>();
	}
};
static_assert(alignof(USQOnlineServicesOnlineUser) == 0x000008, "Wrong alignment on USQOnlineServicesOnlineUser");
static_assert(sizeof(USQOnlineServicesOnlineUser) == 0x000058, "Wrong size on USQOnlineServicesOnlineUser");
static_assert(offsetof(USQOnlineServicesOnlineUser, CachedAvatar) == 0x000038, "Member 'USQOnlineServicesOnlineUser::CachedAvatar' has a wrong offset!");
static_assert(offsetof(USQOnlineServicesOnlineUser, OnGetAvatarComplete) == 0x000040, "Member 'USQOnlineServicesOnlineUser::OnGetAvatarComplete' has a wrong offset!");

// Class SQOnlineServices.SQOnlineServicesBlockedUser
// 0x0000 (0x0058 - 0x0058)
class USQOnlineServicesBlockedUser final : public USQOnlineServicesOnlineUser
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQOnlineServicesBlockedUser">();
	}
	static class USQOnlineServicesBlockedUser* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQOnlineServicesBlockedUser>();
	}
};
static_assert(alignof(USQOnlineServicesBlockedUser) == 0x000008, "Wrong alignment on USQOnlineServicesBlockedUser");
static_assert(sizeof(USQOnlineServicesBlockedUser) == 0x000058, "Wrong size on USQOnlineServicesBlockedUser");

// Class SQOnlineServices.SQOnlineServicesBPLibrary
// 0x0000 (0x0028 - 0x0028)
class USQOnlineServicesBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQOnlineServicesBPLibrary">();
	}
	static class USQOnlineServicesBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQOnlineServicesBPLibrary>();
	}
};
static_assert(alignof(USQOnlineServicesBPLibrary) == 0x000008, "Wrong alignment on USQOnlineServicesBPLibrary");
static_assert(sizeof(USQOnlineServicesBPLibrary) == 0x000028, "Wrong size on USQOnlineServicesBPLibrary");

// Class SQOnlineServices.SQOnlineServicesEAC
// 0x0028 (0x0050 - 0x0028)
class USQOnlineServicesEAC final : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQOnlineServicesEAC">();
	}
	static class USQOnlineServicesEAC* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQOnlineServicesEAC>();
	}
};
static_assert(alignof(USQOnlineServicesEAC) == 0x000008, "Wrong alignment on USQOnlineServicesEAC");
static_assert(sizeof(USQOnlineServicesEAC) == 0x000050, "Wrong size on USQOnlineServicesEAC");

// Class SQOnlineServices.SQOnlineServicesFriends
// 0x0068 (0x0090 - 0x0028)
class USQOnlineServicesFriends final : public UObject
{
public:
	TMulticastInlineDelegate<void(const TArray<class USQOnlineServicesFriendUser*>& Friends, bool bWasSuccessful)> OnFriendsListUpdated; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class USQOnlineServicesFriendUser* FriendUser)> OnPresenceUpdateReceived; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class USQOnlineServicesFriendUser*>    SquadFriendList;                                   // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FBlueprintSessionResult& SessionResult)> OnFindFriendSessionSuccess; // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnFindFriendSessionFail;                           // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	bool                                          bSearchingForFriendSession;                        // 0x0088(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FindFriendSession(const class USQOnlineServicesFriendUser* User);
	TArray<class USQOnlineServicesFriendUser*> GetCachedFriendsList();
	bool IsFriend(const struct FUniqueNetIdRepl& FriendId);
	bool RequestUpdateFriendsList();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQOnlineServicesFriends">();
	}
	static class USQOnlineServicesFriends* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQOnlineServicesFriends>();
	}
};
static_assert(alignof(USQOnlineServicesFriends) == 0x000008, "Wrong alignment on USQOnlineServicesFriends");
static_assert(sizeof(USQOnlineServicesFriends) == 0x000090, "Wrong size on USQOnlineServicesFriends");
static_assert(offsetof(USQOnlineServicesFriends, OnFriendsListUpdated) == 0x000028, "Member 'USQOnlineServicesFriends::OnFriendsListUpdated' has a wrong offset!");
static_assert(offsetof(USQOnlineServicesFriends, OnPresenceUpdateReceived) == 0x000038, "Member 'USQOnlineServicesFriends::OnPresenceUpdateReceived' has a wrong offset!");
static_assert(offsetof(USQOnlineServicesFriends, SquadFriendList) == 0x000048, "Member 'USQOnlineServicesFriends::SquadFriendList' has a wrong offset!");
static_assert(offsetof(USQOnlineServicesFriends, OnFindFriendSessionSuccess) == 0x000068, "Member 'USQOnlineServicesFriends::OnFindFriendSessionSuccess' has a wrong offset!");
static_assert(offsetof(USQOnlineServicesFriends, OnFindFriendSessionFail) == 0x000078, "Member 'USQOnlineServicesFriends::OnFindFriendSessionFail' has a wrong offset!");
static_assert(offsetof(USQOnlineServicesFriends, bSearchingForFriendSession) == 0x000088, "Member 'USQOnlineServicesFriends::bSearchingForFriendSession' has a wrong offset!");

// Class SQOnlineServices.SQOnlineServicesFriendUser
// 0x0088 (0x00E0 - 0x0058)
class USQOnlineServicesFriendUser final : public USQOnlineServicesOnlineUser
{
public:
	uint8                                         Pad_58[0x88];                                      // 0x0058(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsFriendInSession(const struct FBlueprintSessionResult& Session);
	bool UpdateCachedPresence();

	ESQInviteStatus GetInviteStatus() const;
	bool GetIsJoinable() const;
	bool GetIsOnline() const;
	bool GetIsPlaying() const;
	bool GetIsPlayingThisGame() const;
	class FString GetPresenceFactionID() const;
	class FString GetPresenceFactionName() const;
	class FString GetPresenceMapName() const;
	class FString GetPresencePlayerCount() const;
	class FString GetPresenceServerName() const;
	class FString GetStatus() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQOnlineServicesFriendUser">();
	}
	static class USQOnlineServicesFriendUser* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQOnlineServicesFriendUser>();
	}
};
static_assert(alignof(USQOnlineServicesFriendUser) == 0x000008, "Wrong alignment on USQOnlineServicesFriendUser");
static_assert(sizeof(USQOnlineServicesFriendUser) == 0x0000E0, "Wrong size on USQOnlineServicesFriendUser");

// Class SQOnlineServices.SQOnlineServicesLocalUser
// 0x0000 (0x0058 - 0x0058)
class USQOnlineServicesLocalUser final : public USQOnlineServicesOnlineUser
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQOnlineServicesLocalUser">();
	}
	static class USQOnlineServicesLocalUser* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQOnlineServicesLocalUser>();
	}
};
static_assert(alignof(USQOnlineServicesLocalUser) == 0x000008, "Wrong alignment on USQOnlineServicesLocalUser");
static_assert(sizeof(USQOnlineServicesLocalUser) == 0x000058, "Wrong size on USQOnlineServicesLocalUser");

// Class SQOnlineServices.SQOnlineServicesParty
// 0x0058 (0x0080 - 0x0028)
class USQOnlineServicesParty final : public UObject
{
public:
	TMulticastInlineDelegate<void()>              OnPartyJoined;                                     // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPartyLeft;                                       // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& PlayerName)> OnPartyMemberKicked;             // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class USQOnlineServicesPartyUser* Player)> OnPartyMemberPromoted;  // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x10];                                      // 0x0068(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxPartySize;                                      // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CreateParty();
	class USQOnlineServicesPartyUser* GetPartyLeader();
	TArray<class USQOnlineServicesPartyUser*> GetPartyMembers();
	bool IsPartyLeader(const struct FUniqueNetIdRepl& PartyMember);
	bool IsPartyUserLeader(const class USQOnlineServicesPartyUser* PartyMember);
	void KickPlayer(const struct FUniqueNetIdRepl& Player);
	void LeaveParty();
	void PromoteLeader(const struct FUniqueNetIdRepl& Player);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQOnlineServicesParty">();
	}
	static class USQOnlineServicesParty* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQOnlineServicesParty>();
	}
};
static_assert(alignof(USQOnlineServicesParty) == 0x000008, "Wrong alignment on USQOnlineServicesParty");
static_assert(sizeof(USQOnlineServicesParty) == 0x000080, "Wrong size on USQOnlineServicesParty");
static_assert(offsetof(USQOnlineServicesParty, OnPartyJoined) == 0x000028, "Member 'USQOnlineServicesParty::OnPartyJoined' has a wrong offset!");
static_assert(offsetof(USQOnlineServicesParty, OnPartyLeft) == 0x000038, "Member 'USQOnlineServicesParty::OnPartyLeft' has a wrong offset!");
static_assert(offsetof(USQOnlineServicesParty, OnPartyMemberKicked) == 0x000048, "Member 'USQOnlineServicesParty::OnPartyMemberKicked' has a wrong offset!");
static_assert(offsetof(USQOnlineServicesParty, OnPartyMemberPromoted) == 0x000058, "Member 'USQOnlineServicesParty::OnPartyMemberPromoted' has a wrong offset!");
static_assert(offsetof(USQOnlineServicesParty, MaxPartySize) == 0x000078, "Member 'USQOnlineServicesParty::MaxPartySize' has a wrong offset!");

// Class SQOnlineServices.SQOnlineServicesPartyUser
// 0x0000 (0x0058 - 0x0058)
class USQOnlineServicesPartyUser final : public USQOnlineServicesOnlineUser
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQOnlineServicesPartyUser">();
	}
	static class USQOnlineServicesPartyUser* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQOnlineServicesPartyUser>();
	}
};
static_assert(alignof(USQOnlineServicesPartyUser) == 0x000008, "Wrong alignment on USQOnlineServicesPartyUser");
static_assert(sizeof(USQOnlineServicesPartyUser) == 0x000058, "Wrong size on USQOnlineServicesPartyUser");

// Class SQOnlineServices.SQOnlineServicesPingSubsystem
// 0x0138 (0x0168 - 0x0030)
class USQOnlineServicesPingSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x138];                                     // 0x0030(0x0138)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQOnlineServicesPingSubsystem">();
	}
	static class USQOnlineServicesPingSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQOnlineServicesPingSubsystem>();
	}
};
static_assert(alignof(USQOnlineServicesPingSubsystem) == 0x000008, "Wrong alignment on USQOnlineServicesPingSubsystem");
static_assert(sizeof(USQOnlineServicesPingSubsystem) == 0x000168, "Wrong size on USQOnlineServicesPingSubsystem");

// Class SQOnlineServices.SQOnlineServicesRecentUser
// 0x0000 (0x0058 - 0x0058)
class USQOnlineServicesRecentUser final : public USQOnlineServicesOnlineUser
{
public:
	class FString GetLastSeenString();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQOnlineServicesRecentUser">();
	}
	static class USQOnlineServicesRecentUser* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQOnlineServicesRecentUser>();
	}
};
static_assert(alignof(USQOnlineServicesRecentUser) == 0x000008, "Wrong alignment on USQOnlineServicesRecentUser");
static_assert(sizeof(USQOnlineServicesRecentUser) == 0x000058, "Wrong size on USQOnlineServicesRecentUser");

// Class SQOnlineServices.SQOnlineServicesSession
// 0x0010 (0x0038 - 0x0028)
class USQOnlineServicesSession final : public UObject
{
public:
	TMulticastInlineDelegate<void(const struct FBlueprintSessionResult& SessionResult)> OnSessionAccepted; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQOnlineServicesSession">();
	}
	static class USQOnlineServicesSession* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQOnlineServicesSession>();
	}
};
static_assert(alignof(USQOnlineServicesSession) == 0x000008, "Wrong alignment on USQOnlineServicesSession");
static_assert(sizeof(USQOnlineServicesSession) == 0x000038, "Wrong size on USQOnlineServicesSession");
static_assert(offsetof(USQOnlineServicesSession, OnSessionAccepted) == 0x000028, "Member 'USQOnlineServicesSession::OnSessionAccepted' has a wrong offset!");

// Class SQOnlineServices.SQOnlineServicesSubsystem
// 0x0058 (0x0088 - 0x0030)
class USQOnlineServicesSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnlineServiceInitialized;                          // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class USQOnlineServicesFriendUser*            LastJoinedFriendUser;                              // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USQOnlineServicesLocalUser*             LocalUser;                                         // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USQOnlineServicesFriends*               FriendsService;                                    // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USQOnlineServicesSession*               SessionService;                                    // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USQOnlineServicesEAC*                   EACService;                                        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetPlayerPresence(const class FString& ServerName, const class FString& Faction, const class FString& FactionID, const class FString& Map, const class FString& Players, bool bDisplayDetails);
	void SetStatusDefault();

	class USQOnlineServicesLocalUser* GetLocalUser() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQOnlineServicesSubsystem">();
	}
	static class USQOnlineServicesSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQOnlineServicesSubsystem>();
	}
};
static_assert(alignof(USQOnlineServicesSubsystem) == 0x000008, "Wrong alignment on USQOnlineServicesSubsystem");
static_assert(sizeof(USQOnlineServicesSubsystem) == 0x000088, "Wrong size on USQOnlineServicesSubsystem");
static_assert(offsetof(USQOnlineServicesSubsystem, OnlineServiceInitialized) == 0x000048, "Member 'USQOnlineServicesSubsystem::OnlineServiceInitialized' has a wrong offset!");
static_assert(offsetof(USQOnlineServicesSubsystem, LastJoinedFriendUser) == 0x000058, "Member 'USQOnlineServicesSubsystem::LastJoinedFriendUser' has a wrong offset!");
static_assert(offsetof(USQOnlineServicesSubsystem, LocalUser) == 0x000068, "Member 'USQOnlineServicesSubsystem::LocalUser' has a wrong offset!");
static_assert(offsetof(USQOnlineServicesSubsystem, FriendsService) == 0x000070, "Member 'USQOnlineServicesSubsystem::FriendsService' has a wrong offset!");
static_assert(offsetof(USQOnlineServicesSubsystem, SessionService) == 0x000078, "Member 'USQOnlineServicesSubsystem::SessionService' has a wrong offset!");
static_assert(offsetof(USQOnlineServicesSubsystem, EACService) == 0x000080, "Member 'USQOnlineServicesSubsystem::EACService' has a wrong offset!");

// Class SQOnlineServices.SQOnlineServicesUpdateSessionManager
// 0x0078 (0x00A8 - 0x0030)
class USQOnlineServicesUpdateSessionManager final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x78];                                      // 0x0030(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQOnlineServicesUpdateSessionManager">();
	}
	static class USQOnlineServicesUpdateSessionManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQOnlineServicesUpdateSessionManager>();
	}
};
static_assert(alignof(USQOnlineServicesUpdateSessionManager) == 0x000008, "Wrong alignment on USQOnlineServicesUpdateSessionManager");
static_assert(sizeof(USQOnlineServicesUpdateSessionManager) == 0x0000A8, "Wrong size on USQOnlineServicesUpdateSessionManager");

}

