#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Friend

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Squad_structs.hpp"
#include "Squad_classes.hpp"
#include "OnlineSubsystemUtils_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Friend.W_Friend_C
// 0x0258 (0x04C0 - 0x0268)
class UW_Friend_C final : public USQFriendEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Main;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Button_C*                     ButtonJoin;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flag_TeamFaction;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ProfilePicture;                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_StatusIndicator;                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Flag;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TB_FactionName;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TB_MapName;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TB_Name;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TB_PlayerCount;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TB_ServerName;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_FactionFlag;                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class USQOnlineServicesFriendUser* FriendUser)> RequestJoin;       // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 Marquee_String;                                    // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSQBlueprintFriend                     Friend_Struct;                                     // 0x02F0(0x0060)(Edit, BlueprintVisible)
	struct FBlueprintSessionResult                Friends_Session;                                   // 0x0350(0x0108)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USQSessionInfo*                         SessionInfo;                                       // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               DefaultAvatar;                                     // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           OfflineColour;                                     // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           OnlineColour;                                      // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           InGameColour;                                      // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnPresenceChanged;                                 // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bHovered;                                          // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           MarqueeIntervalTimer;                              // 0x04B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         MarqueeInterval;                                   // 0x04B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Friend(int32 EntryPoint);
	void AsyncLoadFlag();
	void BndEvt__W_Friend_Button_Main_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ButtonJoin_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(bool bSelected, class UMainMenu_Button_C* Button);
	void BndEvt__Button_64_K2Node_ComponentBoundEvent_18_OnButtonHoverEvent__DelegateSignature();
	void Init_Data();
	void OnAvatarGetComplete(bool bWasSuccessful, class UTexture* ResultTexture);
	void InitPresence();
	bool Get_ButtonJoin_bIsEnabled_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Friend_C">();
	}
	static class UW_Friend_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Friend_C>();
	}
};
static_assert(alignof(UW_Friend_C) == 0x000008, "Wrong alignment on UW_Friend_C");
static_assert(sizeof(UW_Friend_C) == 0x0004C0, "Wrong size on UW_Friend_C");
static_assert(offsetof(UW_Friend_C, UberGraphFrame) == 0x000268, "Member 'UW_Friend_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, Button_Main) == 0x000270, "Member 'UW_Friend_C::Button_Main' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, ButtonJoin) == 0x000278, "Member 'UW_Friend_C::ButtonJoin' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, Flag_TeamFaction) == 0x000280, "Member 'UW_Friend_C::Flag_TeamFaction' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, Image_ProfilePicture) == 0x000288, "Member 'UW_Friend_C::Image_ProfilePicture' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, Image_StatusIndicator) == 0x000290, "Member 'UW_Friend_C::Image_StatusIndicator' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, SizeBox_Flag) == 0x000298, "Member 'UW_Friend_C::SizeBox_Flag' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, TB_FactionName) == 0x0002A0, "Member 'UW_Friend_C::TB_FactionName' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, TB_MapName) == 0x0002A8, "Member 'UW_Friend_C::TB_MapName' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, TB_Name) == 0x0002B0, "Member 'UW_Friend_C::TB_Name' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, TB_PlayerCount) == 0x0002B8, "Member 'UW_Friend_C::TB_PlayerCount' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, TB_ServerName) == 0x0002C0, "Member 'UW_Friend_C::TB_ServerName' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, WidgetSwitcher_FactionFlag) == 0x0002C8, "Member 'UW_Friend_C::WidgetSwitcher_FactionFlag' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, RequestJoin) == 0x0002D0, "Member 'UW_Friend_C::RequestJoin' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, Marquee_String) == 0x0002E0, "Member 'UW_Friend_C::Marquee_String' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, Friend_Struct) == 0x0002F0, "Member 'UW_Friend_C::Friend_Struct' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, Friends_Session) == 0x000350, "Member 'UW_Friend_C::Friends_Session' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, SessionInfo) == 0x000458, "Member 'UW_Friend_C::SessionInfo' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, DefaultAvatar) == 0x000460, "Member 'UW_Friend_C::DefaultAvatar' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, OfflineColour) == 0x000468, "Member 'UW_Friend_C::OfflineColour' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, OnlineColour) == 0x000478, "Member 'UW_Friend_C::OnlineColour' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, InGameColour) == 0x000488, "Member 'UW_Friend_C::InGameColour' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, OnPresenceChanged) == 0x000498, "Member 'UW_Friend_C::OnPresenceChanged' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, bHovered) == 0x0004A8, "Member 'UW_Friend_C::bHovered' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, MarqueeIntervalTimer) == 0x0004B0, "Member 'UW_Friend_C::MarqueeIntervalTimer' has a wrong offset!");
static_assert(offsetof(UW_Friend_C, MarqueeInterval) == 0x0004B8, "Member 'UW_Friend_C::MarqueeInterval' has a wrong offset!");

}

